target/classes/a.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <getUserInfo xmlns="http://tempuri.org/">
      <appKey>201512300001</appKey>
      <appPassword>ZXWFVB_GHL-123</appPassword>
      <mobileNum>{0}</mobileNum>
   </getUserInfo>
  </soap:Body>
</soap:Envelope>